"""
    目的：实用内科学提取
    日期：2024.06.17
"""
import os
import re

import pdfplumber


def getTxtName(folderPath):
    for file_name in os.listdir(folderPath):
        print(file_name.strip('.txt').split('+')[3] + '\t' + file_name.strip('.txt'))


def pdfToTxt(pdfPath, outputPath):
    with pdfplumber.open(pdfPath) as pdf:
        text_list = []
        for page in pdf.pages:
            page_text = page.extract_text()
            words = page_text.split()
            line = ''.join(words)
            text_list.append(line)
    text = '\n'.join(text_list)
    with open(outputPath, 'w', encoding='utf-8') as f:
        f.write(text)


def isInPdf(keywordList, pdfPath, pdfPath01):
    with pdfplumber.open(pdfPath) as pdf:
        all_text = ""
        for page in pdf.pages:
            all_text = page.extract_text()
    with pdfplumber.open(pdfPath01) as pdf:
        all_text01 = ""
        for page in pdf.pages:
            all_text01 = page.extract_text()
    for keyword in keywordList:
        if keyword in all_text or keyword in all_text01:
            print(keyword + "\t在文章中出现过")
    pdf.close()


def isInTxt(keyworList, txtPath):
    with open(txtPath, 'r', encoding='utf-8') as f:
        contents = f.read()
        for keyword in keywordList:
            if keyword in contents:
                print(keyword + '\t在')
            else:
                print(keyword + '\t不在')
    f.close()


def extractSection(txtPath):
    with open(txtPath, 'r', encoding='utf-8') as f:
        contents = f.read()
        f.close()
        sections = re.findall(r'\n第(.*)节\u3000(.*)\n', contents)
        for section in sections:
            print(section[1])


if __name__ == '__main__':
    keywordList = ['适应障碍', '轻度神经认知障碍', '转换障碍或功能性神经症状障碍', '躯体症状障碍', '结核病',
                   '神经性贪食症',
                   '神经性厌食症', '癫痫', '癫痫', '癫痫', '癫痫', '癫痫', '癫痫', '痴呆', '痴呆', '痴呆',
                   '疾病焦虑障碍',
                   '环性心境障碍', '炎性肌病', '注意缺陷多动障碍', '注意缺陷多动障碍', '抽动秽语综合征',
                   '回避性/限制性摄食障碍',
                   '双相障碍', '双相障碍', '分离性障碍', '心脏神经症', '马尔堡病毒病', '肾性糖尿', '甲状腺恶性肿瘤',
                   '卟啉病',
                   '单纯疱疹病毒性脑炎', '肠道病毒感染', '透明丝孢霉病', '肝吸虫病', '窦性心律失常', '支气管-肺真菌病',
                   '肺结节',
                   '肺动静脉畸形', '膈肌肿瘤', '气管食管瘘', '膜增生性肾小球肾炎', '类风湿关节炎肾损害',
                   '混合性结缔组织病肾损害',
                   '原发性干燥综合征肾损害', '特殊类型糖尿病', '急性应激反应', '麻风病', '免疫复合物性小血管炎',
                   '神经病理性疼痛',
                   '智力发育障碍', '发育性学习障碍', '恶劣心境障碍', '延长哀伤障碍', '尼古丁依赖', '基孔肯亚热',
                   '侵害中枢神经系统的虫媒病毒感染',
                   '其他衣原体感染', '人嗜粒细胞无形体病', '其他不发酵糖细菌感染', '马尔尼菲篮状菌病', '人类非洲锥虫病',
                   '猪囊尾蚴病（囊虫病）',
                   '棘球蚴病（包虫病）', '弧菌、耶尔森菌及气单胞菌所致腹泻·', '幼虫移行症', '逸搏和逸搏心律', '人兽共患病',
                   '与心律失常有关的综合征',
                   '慢性冠状动脉综合征', '免疫受损宿主肺炎', '手足发绀', '骨髓及实体器官移植后肺部感染', '上呼吸道阻塞',
                   '药物性肺病和放射性肺炎',
                   '具有自身免疫特征的间质性肺炎', '原发性纵隔肿瘤或囊肿', '嗜酸性粒细胞性胃肠病', '消化道憩室',
                   '梭菌坏死性肠炎', '胰腺囊性肿瘤',
                   '胆囊和Oddi括约肌功能障碍', '骨髓增生异常/骨髓增殖性肿瘤', '性粒细胞功能障碍', '巴结肿大与脾大',
                   '淋巴浆细胞性淋巴瘤/Waldenstrom巨球蛋白血症', '血栓性血小板减少性紫瘢和溶血尿毒综合征', '血管性紫瘢',
                   '过敏性紫瘢',
                   '无症状蛋白尿和/或血尿', '连续性肾脏替代治疗', '感染相关性肾小球肾炎', 'IgA血管炎肾损害', 'Clq肾病',
                   '抗中性粒细胞胞质抗体相关性血管炎肾损害', '副蛋白相关肾脏病', '高尿酸血症肾病', '系统性硬化症肾损害',
                   '肾石症',
                   '肾小管钠/钾转运障碍', '肾小管钙/磷转运障碍', '肾脏恶性肿瘤', 'V型心肾综合征', 'II型心肾综合征',
                   '肾脏良性肿瘤',
                   '肺肾综合征', 'IV型心肾综合征', '肾脏疾病相关高尿酸血症', '嗜锯细胞瘤和副神经节瘤',
                   '高催乳素血症和催乳素瘤',
                   '抗利尿激素分泌失调综合征', '胰高血糖素瘤', '异位ACTH综合征', '其他EPS', '遗传性内分泌腺瘤病',
                   '伴瘤高钙血症',
                   '糖原贮积症', '脊柱关节炎', '抗中性粒细胞胞质抗体相关性血管炎', '短暂性缺血发作',
                   '带状疱疹病毒性脑炎', '自身免疫性脑炎',
                   '神经丛病和多脑神经病', '遗传性感觉运动性神经病', '多发性周围神经病和免疫介导性周围神经病',
                   '其他周围神经病变',
                   '感染相关炎性周围神经病', '运动神经元疾病', '低血糖性神经系统损害', '抑郁症的疾病特点',
                   '精神分裂症及其他原发性精神病性障碍',
                   '抑郁症的治疗', '复合性创伤后应激障碍', '做作性精神障碍', '其他相关障碍',
                   '心理因素影响的躯体疾病或其他躯体疾病',
                   '冲动控制障碍', '破坏性障碍或品行障碍', '遗忘性障碍', '成瘾行为所致障碍']
    keywordList01 = ['　适应障碍', '　轻度神经认知障碍', '　转换障碍或功能性神经症状障碍', '　躯体症状障碍', '　结核病',
                     '　神经性贪食症',
                     '　神经性厌食症', '　癫痫', '　癫痫', '　癫痫', '　癫痫', '　癫痫', '　癫痫', '　痴呆', '　痴呆', '　痴呆',
                     '　疾病焦虑障碍',
                     '　环性心境障碍', '　炎性肌病', '　注意缺陷多动障碍', '　注意缺陷多动障碍', '　抽动秽语综合征',
                     '　回避性/限制性摄食障碍',
                     '　双相障碍', '　双相障碍', '　分离性障碍', '　心脏神经症', '　马尔堡病毒病', '　肾性糖尿',
                     '　甲状腺恶性肿瘤',
                     '　卟啉病',
                     '　单纯疱疹病毒性脑炎', '　肠道病毒感染', '　透明丝孢霉病', '　肝吸虫病', '　窦性心律失常',
                     '　支气管-肺真菌病',
                     '　肺结节',
                     '　肺动静脉畸形', '　膈肌肿瘤', '　气管食管瘘', '　膜增生性肾小球肾炎', '　类风湿关节炎肾损害',
                     '　混合性结缔组织病肾损害',
                     '　原发性干燥综合征肾损害', '　特殊类型糖尿病', '　急性应激反应', '　麻风病', '　免疫复合物性小血管炎',
                     '　神经病理性疼痛',
                     '　智力发育障碍', '　发育性学习障碍', '　恶劣心境障碍', '　延长哀伤障碍', '　尼古丁依赖', '　基孔肯亚热',
                     '　侵害中枢神经系统的虫媒病毒感染',
                     '　其他衣原体感染', '　人嗜粒细胞无形体病', '　其他不发酵糖细菌感染', '　马尔尼菲篮状菌病',
                     '　人类非洲锥虫病',
                     '　猪囊尾蚴病（囊虫病）',
                     '　棘球蚴病（包虫病）', '　弧菌、耶尔森菌及气单胞菌所致腹泻·', '　幼虫移行症', '　逸搏和逸搏心律',
                     '　人兽共患病',
                     '　与心律失常有关的综合征',
                     '　慢性冠状动脉综合征', '　免疫受损宿主肺炎', '　手足发绀', '　骨髓及实体器官移植后肺部感染',
                     '　上呼吸道阻塞',
                     '　药物性肺病和放射性肺炎',
                     '　具有自身免疫特征的间质性肺炎', '　原发性纵隔肿瘤或囊肿', '　嗜酸性粒细胞性胃肠病', '　消化道憩室',
                     '　梭菌坏死性肠炎', '　胰腺囊性肿瘤',
                     '　胆囊和Oddi括约肌功能障碍', '　骨髓增生异常/骨髓增殖性肿瘤', '　性粒细胞功能障碍',
                     '　巴结肿大与脾大',
                     '　淋巴浆细胞性淋巴瘤/Waldenstrom巨球蛋白血症', '　血栓性血小板减少性紫瘢和溶血尿毒综合征',
                     '　血管性紫瘢',
                     '　过敏性紫瘢',
                     '　无症状蛋白尿和/或血尿', '　连续性肾脏替代治疗', '　感染相关性肾小球肾炎', '　IgA血管炎肾损害',
                     '　Clq肾病',
                     '　抗中性粒细胞胞质抗体相关性血管炎肾损害', '　副蛋白相关肾脏病', '　高尿酸血症肾病',
                     '　系统性硬化症肾损害',
                     '　肾石症',
                     '　肾小管钠/钾转运障碍', '　肾小管钙/磷转运障碍', '　肾脏恶性肿瘤', '　V型心肾综合征',
                     '　II型心肾综合征',
                     '　肾脏良性肿瘤',
                     '　肺肾综合征', '　IV型心肾综合征', '　肾脏疾病相关高尿酸血症', '　嗜锯细胞瘤和副神经节瘤',
                     '　高催乳素血症和催乳素瘤',
                     '　抗利尿激素分泌失调综合征', '　胰高血糖素瘤', '　异位ACTH综合征', '　其他EPS', '　遗传性内分泌腺瘤病',
                     '　伴瘤高钙血症',
                     '　糖原贮积症', '　脊柱关节炎', '　抗中性粒细胞胞质抗体相关性血管炎', '　短暂性缺血发作',
                     '　带状疱疹病毒性脑炎', '　自身免疫性脑炎',
                     '　神经丛病和多脑神经病', '　遗传性感觉运动性神经病', '　多发性周围神经病和免疫介导性周围神经病',
                     '　其他周围神经病变',
                     '　感染相关炎性周围神经病', '　运动神经元疾病', '　低血糖性神经系统损害', '　抑郁症的疾病特点',
                     '　精神分裂症及其他原发性精神病性障碍',
                     '　抑郁症的治疗', '　复合性创伤后应激障碍', '　做作性精神障碍', '　其他相关障碍',
                     '　心理因素影响的躯体疾病或其他躯体疾病',
                     '　冲动控制障碍', '　破坏性障碍或品行障碍', '　遗忘性障碍', '　成瘾行为所致障碍']
    folder = r'D:\RJ_WORKFILE\\Chinese_Medicine\周老师\20240617-实用内科学文本提取\实用内科学TXT拆分'
    pdfPath = r'D:\RJ_WORKFILE\Chinese_Medicine\周老师\20240617-实用内科学文本提取\实用内科学第16版上册.pdf'
    pdfPath01 = r'D:\RJ_WORKFILE\Chinese_Medicine\周老师\20240617-实用内科学文本提取\实用内科学第16版下册.pdf'
    txtPath = r'D:\RJ_WORKFILE\Chinese_Medicine\周老师\20240617-实用内科学文本提取\实用内科学-十篇后.txt'
    extractSection(txtPath)
    # isInTxt(keywordList01, txtPath)
    # isInPdf(keywordList, pdfPath, pdfPath01)
    # pdfToTxt(pdfPath, txtPath)
    # getTxtName(folder)
