# from spire.xls import *
# from spire.xls.common import *
#
# file_path = r"F:\工作\Chinese_Medicine\周老师\202408\20240801-博士论文-ING\数据-新\20240830博士论文数据 - 副本.xlsx"
# save_file = r"F:\工作\Chinese_Medicine\周老师\202408\20240801-博士论文-ING\数据-新\20240830博士论文数据-替换.xlsx"
# workbook = Workbook()
# workbook.LoadFromFile(file_path)
# worksheet = workbook.Worksheets[0]
list_origin = ["瘀血内阻型", "饮食伤胃型", "阴虚火炽型", "寒盛阳衰型", "阳虚内寒型", "血虚发热型", "心气不足型",
               "心气阳虚型", "心络瘀阻型", "心脉瘀阻型", "心血亏虚型", "心脾不足型", "心脾亏虚型", "心脾气虚型",
               "心火亢盛型", "心火内盛型", "胃火上炎型", "肠胃俱虚型", "痰浊壅肺型", "痰湿内阻型", "肺胃痰热型",
               "痰热壅肺型", "痰热郁肺型", "痰热蕴肺型", "痰气郁结型", "痰火扰心型", "痰热扰心型", "暑邪犯肺型",
               "食滞胃脘型", "食滞型", "湿热夹杂型", "湿热内侵型", "湿热内蕴型", "湿热蕴结型", "湿热蕴阻型",
               "湿热壅滞型", "下焦湿热型", "肾阴亏虚型", "肾阳不振型", "肾阳不足型", "肾阳亏虚型", "肾阳虚衰型",
               "肾阳虚型", "肾虚寒盛型", "肾虚失固型", "肾气不充型", "肾气不足型", "肾气亏损型", "肾气亏虚型",
               "肾气虚型", "肾精不足型", "肾精亏型", "毒热炽盛型", "热毒型", "热毒蕴结型", "气血凝滞型", "气郁血滞型",
               "气郁瘀阻型", "血瘀气滞型", "气郁痰阻型", "气阴亏虚型", "气血不足型", "气血亏虚型", "气血两亏型",
               "气血两虚型", "气血虚弱型", "气虚痰咳型", "气虚痰阻型", "气机阻滞型", "脾阳虚衰型", "脾阳虚型",
               "脾虚痰壅型", "脾虚痰阻型", "脾虚水泛型", "脾虚水停型", "脾虚湿盛型", "脾虚湿郁型", "脾虚湿蕴型",
               "脾虚湿滞型", "脾虚湿阻型", "脾虚下陷型", "脾虚停食型", "脾经湿热型", "脾胃亏虚型", "脾胃虚弱型",
               "脾虚胃弱型", "脾肾阳衰型", "脾肾亏虚型", "脾肾两虚型", "脾气亏虚型", "脾气虚型", "脾虚气陷型",
               "脉络瘀阻型", "火热伤津型", "火毒凝结型", "寒邪客胃型", "寒邪内阻型", "风寒夹痰型", "寒湿伤脾型",
               "寒凝血滞型", "肝气郁结型", "肝气郁滞型", "肝郁化热型", "肝郁火旺型", "肝阴亏虚型", "肝阳暴涨型",
               "肝阳化火型", "肝阳偏亢型", "肝阳上亢型", "肝阳上扰型", "阴虚肝旺型", "肝血虚弱型", "肝气犯胃型",
               "肝肾阴亏型", "肝肾不足型", "肝肾精血亏虚型", "肝肾亏损型", "肝肾亏虚型", "肝肾两虚型", "肝肾虚衰型",
               "肝脾失调型", "肝经郁火型", "肝经蕴热型", "肝火上逆型", "肝火上炎型", "肝火炽盛型", "肝经火旺型",
               "肝胆湿热型", "肝经湿热型", "风寒燥邪伤肺型", "风热燥邪伤肺型", "风邪外犯型", "风邪外袭型", "风湿犯表型",
               "风热夹痰型", "风热闭肺型", "风热咳嗽型", "风温犯肺型", "风温袭肺型", "湿热犯肺型", "风热侵袭型",
               "外感风热型", "风温闭肺型", "风寒咳嗽型", "风寒闭肺型", "风寒壅肺型", "风邪干胃型", "肺阴不足型",
               "肺阴亏损型", "肺阴亏虚型", "肺虚内寒型", "肺胃津伤型", "肺燥津枯型", "肺胃积热型", "肺胃热壅型",
               "肺胃郁热型", "肺热腑实型", "肺气不足型", "肺气亏虚型", "肺气虚耗型", "肺虚型", "肺脾气虚型",
               "肺郁脾虚型", "脾肺气虚型", "肠胃积热型", "胃肠结热型", "胃肠热结型", "胃肠燥热型", "肠胃湿热型",
               "膀胱湿热蕴阻型", "膀脘湿热型"]
list_destination = ["瘀血内结型", "饮食积滞型", "阴虚火旺型", "阳虚寒胜型", "阳虚寒凝型", "血虚型", "心阳虚型",
                    "心阳虚型", "心血瘀阻型", "心血瘀阻型", "心血不足型", "心脾两虚型", "心脾两虚型", "心脾两虚型",
                    "心火炽盛型", "心火炽盛型", "胃热炽盛型", "胃气虚证", "痰浊阻肺型", "痰湿型", "痰热阻肺型",
                    "痰热阻肺型", "痰热阻肺型", "痰热阻肺型", "痰气交阻型", "痰火扰神型", "痰火扰神型", "暑犯气分型",
                    "食滞脾胃型", "食滞脾胃型", "湿热蕴结型", "湿热蕴结型", "湿热蕴结型", "湿热蕴结型", "湿热蕴结型",
                    "湿热壅盛型", "湿热下注型", "肾阴虚型", "肾阳虚衰型", "肾阳虚衰型", "肾阳虚衰型", "肾阳虚衰型",
                    "肾阳虚衰型", "肾虚寒凝型", "肾气不固型", "肾气不充型", "肾气不充型", "肾气不充型", "肾气不充型",
                    "肾气不充型", "肾精亏虚型", "肾精亏虚型", "热毒型", "热毒炽盛型", "热毒炽盛型", "气滞血瘀型",
                    "气滞血瘀型", "气滞血瘀型", "气滞血瘀型", "气滞痰凝型", "气阴两虚型", "气血两虚型", "气血两虚型",
                    "气血两虚型", "气血两虚型", "气血两虚型", "气虚痰结型", "气虚痰结型", "气机郁滞型", "脾阳虚弱型",
                    "脾阳虚弱型", "脾虚痰盛型", "脾虚痰盛型", "脾虚水停型", "脾虚水停型", "脾虚湿困型", "脾虚湿困型",
                    "脾虚湿困型", "脾虚湿困型", "脾虚湿困型", "脾虚气陷型", "脾虚夹积型", "脾胃湿热型", "脾胃气虚型",
                    "脾胃气虚型", "脾胃气虚型", "脾肾阳虚型", "脾肾两虚型", "脾肾两虚型", "脾气虚弱型", "脾气虚弱型",
                    "脾气不升型", "经脉瘀阻型", "火盛伤阴型", "火毒蕴结型", "寒邪犯胃型", "寒邪犯胃型", "寒痰型",
                    "寒湿困脾型", "寒凝血瘀型", "肝郁气滞型", "肝郁气滞型", "肝郁化火型", "肝郁化火型", "肝阴虚型",
                    "肝阳亢盛型", "肝阳亢盛型", "肝阳亢盛型", "肝阳亢盛型", "肝阳亢盛型", "肝阳亢盛型", "肝血虚型",
                    "肝胃不和型", "肝肾阴虚型", "肝肾亏虚型", "肝肾亏虚型", "肝肾亏虚型", "肝肾亏虚型", "肝肾亏虚型",
                    "肝肾亏虚型", "肝脾不调型", "肝经郁热型", "肝经郁热型", "肝火上扰型", "肝火上扰型", "肝火亢盛型",
                    "肝火亢盛型", "肝胆湿热型", "肝胆湿热型", "风燥伤肺型", "风燥伤肺型", "风邪袭表型", "风邪袭表型",
                    "风湿表型", "风热痰凝型", "风热犯肺型", "风热犯肺型", "风热犯肺型", "风热犯肺型", "风热犯肺型",
                    "风热犯表型", "风热犯表型", "风热闭肺型", "风寒型", "风寒袭肺型", "风寒袭肺型", "风寒犯胃型",
                    "肺阴虚型", "肺阴虚型", "肺阴虚型", "肺阳虚型", "肺胃阴虚型", "肺胃阴虚型", "肺胃热盛型",
                    "肺胃热盛型", "肺胃热盛型", "肺热型", "肺气虚型", "肺气虚型", "肺气虚型", "肺气虚型", "肺脾两虚型",
                    "肺脾两虚型", "肺脾两虚型", "肠胃实热型", "肠胃实热型", "肠胃实热型", "肠胃实热型", "肠道湿热型",
                    "膀胱湿热型", "膀胱湿热型"]

# for i in range(0, len(list_origin)):
#     ranges = worksheet.FindAllString(list_origin[i], False, False)
#     for ran in ranges:
#         ran.Text = list_destination[i]
#
# workbook.SaveToFile(save_file, ExcelVersion.Version2016)
# workbook.Dispose()
print(len(list_origin))
